// prompt 창으로 입력받은 값은 기본적으로 문자형타입으로 지정

//! 문제 1

// : 사용자로부터 숫자값을 입력받아 해당 숫자가 짝수인지 홀수인지를 결정하여 콘솔에 출력
//   짝수일 경우 "짝수" 출력
//   홀수일 경우 "홀수" 출력
// -결과-------------------------------------------------------//

let num = prompt('숫자를 입력하세요');
console.log(num % 2 === 0 ? '짝수' : '홀수');



//! 문제 2

// 변수 total이 0으로 시작
// : 아래의 연산 후 total의 값을 콘솔에 출력

// 1) 5를 추가하세요.
// 2) 결과값에 3을 곱하세요.
// 3) 결과값에서 2를 빼세요.

// -결과------------------------------------------------------//



let total = 0;
total += 5;
total *= 3;
total -= 2;
console.log(`결과 값 : ${total}`);

//! 문제 3

// 변수 x의 값에 따라 "양수", "음수", "제로" 중 하나를 출력하는 코드를 조건 연산자를 사용하여 작성

let x = 0; // 여기에 임의의 숫자를 입력

// 여기에 로직 코드를 작성

//-결과------------------------------------------------------//

console.log(x === 0 ? "제로" : (x > 0 ? "양수" : "음수"));
console.log(x > 0 ? "양수" : (x < 0 ? "음수" : "제로"));
console.log(x < 0 ? "음수" : (x === 0 ? "제로" : "양수"));

// ! 문제 4 
// 삼각형의 넓이 계산하기 
// 삼각형의 밑변(base)과 높이(height)를 사용자로부터 입력받아 넓이(area)를 계산하고, 그 결과를 콘솔에 출력 
// >> 삼각형의 넓이 구하는 공식 : 밑변 * 높이 * 0.5

let base = Number(prompt("밑변을 입력하세요"));
let height = Number(prompt("높이를 입력하세요"));
let area = base * height * 0.5

console.log(`삼각형의 넓이는 ${area}`);


// ! 문제 5
// 평균 구하기
// 사용자로부터 세 개의 숫자를 입력받아 이들의 평균을 계산하고, 그 결과를 콘솔에 출력 

let num1 = Number(prompt("첫 번째 숫자를 입력하세요"));
let num2 = Number(prompt("두 번째 숫자를 입력하세요"));
let num3 = Number(prompt("세 번째 숫자를 입력하세요"));

let avg = (num1 + num2 + num3) / 3;
console.log(`평균 : ${avg}`);




// if (num1 < 0 || num1 > 100 || num2 < 0 || num2 > 100 || num3 < 0 || num3 > 100) {
//   console.log(`올바른 숫자가 아닙니다 다시 입력하세요`);
// }else {
//   let avg = (num1 + num2 + num3) / 3;
//   console.log(`평균 : ${avg}`);
// }

